package nekorom.com.kasaApp

import org.junit.Test

import org.junit.Assert.*

/**
 * ====================================================================================================
 * ЛОКАЛЬНИЙ МОДУЛЬНИЙ ТЕСТ ДЛЯ ANDROID (JVM UNIT TEST)
 * ====================================================================================================
 *
 * Виконується на машині розробника у середовищі JVM без необхідності запуску Android-емулятора.
 */
class ExampleUnitTest {
    /**
     * Базовий тест валідності арифметичних операцій у середовищі JUnit.
     */
    @Test
    fun addition_isCorrect() {
        assertEquals(4, 2 + 2)
    }
}