package com.example.exellio20

import org.junit.Test
import org.junit.Assert.*

/**
 * ====================================================================================================
 * МОДУЛЬНИЙ ТЕСТ JVM ДЛЯ EXELLIO 2.0 (JVM UNIT TEST)
 * ====================================================================================================
 *
 * Виконується на машині розробника під час компіляції Gradle.
 */
class ExampleUnitTest {
    /**
     * Базова перевірка працездатності тестового фреймворку JUnit.
     */
    @Test
    fun addition_isCorrect() {
        assertEquals(4, 2 + 2)
    }
}